# vsoSetInCurtainWall

## Description
Used during event 52 to retrun whether an object is aCurtain Wall object

```pascal
PROCEDURE vsoSetInCurtainWall(inCurtainWall : BOOLEAN);
```

```python
def vs.vsoSetInCurtainWall(inCurtainWall):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inCurtainWall|BOOLEAN|   |

## Examples
```pascal
vsoSetInCurtainWall(TRUE);
```
```python
import vs

# Used during event 52 to retrun whether an object is aCurtain Wall object.
inCurtainWall = True

vs.vsoSetInCurtainWall(inCurtainWall)
```

## Version
Availability: from Vectorworks 2015

## Category
* Object Events